src/InformationRegisters/_ИсторияОповещенийПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>_ИсторияОповещенийПользователей</Name>
			<Comment>(служебный, для регистрации и логирования оповещений)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТекстОповещения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Прочитано</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Системное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПовторов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кому</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/CommonModules/ОбработкаОповещенияПользователей/Ext/Module.bsl
Процедура ОтобразитьОповещенияТекущемуПользователю() Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|   История.Период,
	|   История.Кому,
	|	История.ТекстОповещения
	|ИЗ
	|	РегистрСведений._ИсторияОповещенийПользователей.СрезПоследних(
	|			&ТекущаяДата,
	|			Кому = &ТекущийПользователь
	|				И НЕ Прочитано
	|				И ДатаНачала <= &ТекущаяДата
	|				И ДатаОкончания >= &ТекущаяДата) КАК История"
	);
			
	Запрос.УстановитьПараметр("ТекущийПользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПоказатьОповещениеПользователя("Торговля8. Новое уведомление", , , БиблиотекаКартинок.Важно);
		//
		//СтруктураСообщения = Новый Структура;
		//СтруктураСообщения.Вставить("Период", Выборка.Период);
		//СтруктураСообщения.Вставить("Кому", Выборка.Кому);
		//ПометитьОповещениеПрочитанным(СтруктураСообщения);
		
		ФормаОповещения = ПолучитьОбщуюФорму("ФормаОповещенияПользователя");
		ФормаОповещения.Период = Выборка.Период;
		ФормаОповещения.Кому = Выборка.Кому;
		ФормаОповещения.ТекстСообщения = Выборка.ТекстОповещения;
		
		Если НЕ ФормаОповещения.Открыта() Тогда
			ФормаОповещения.Открыть();
			
		КонецЕсли;
				
	КонецЦикла;
	
КонецПроцедуры

Процедура ПометитьОповещениеПрочитанным(СтруктураСообщения) Экспорт
	аНабор = РегистрыСведений._ИсторияОповещенийПользователей.СоздатьНаборЗаписей();
	аНабор.Отбор.Период.ВидСравнения = ВидСравнения.Равно;
	аНабор.Отбор.Период.Значение = СтруктураСообщения.Период;
	аНабор.Отбор.Период.Использование = Истина;
	аНабор.Отбор.Кому.ВидСравнения = ВидСравнения.Равно;
	аНабор.Отбор.Кому.Значение = СтруктураСообщения.Кому;
	аНабор.Отбор.Кому.Использование = Истина;
	
	аНабор.Прочитать();
	Для Каждого аЗапись ИЗ аНабор Цикл
		Если аЗапись.КоличествоПовторов = 10 Тогда
			аЗапись.Прочитано = Истина;
		Иначе
			Если СтруктураСообщения.Свойство("Завершить") Тогда
				Если  СтруктураСообщения.Завершить Тогда
					аЗапись.Прочитано = Истина;
				КонецЕсли;
				
			КонецЕсли;
			аЗапись.КоличествоПовторов = аЗапись.КоличествоПовторов + 1;
			
		КонецЕсли;
		
	КонецЦикла;
	
	аНабор.Записать(Истина);
	
КонецПроцедуры
